performance/artilleryRacePostTest.yml
config:
  target: "http://localhost:8080"
  #"http://192.168.49.2:32002"
  #"http://192.168.49.2:31660"
  #192.168.49.2:31097
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 35
  phases:
    - duration: 10
      arrivalRate: 10000

  payload:
    path: "application_202211061120.csv"
    fields:
        - "applicationCode"
        - "athleteId"
        - "raceId"

scenarios:
  - name: "Search and buy"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
          capture:
            - json: "$.id"
              as: "trackId"