performance/artilleryRacePostTest.yml
config:
  target: "http://192.168.49.2:31522"
  #"http://192.168.49.2:31660"
  #192.168.49.2:31097
#  payload:
#      # path relativo a la localización del script de test
#      path: "users.csv"
#      fields:
#        - "username"
#        - "password"
  phases:
    - duration: 10
      arrivalRate: 5000

  payload:

    path: "applicationId.csv"
    fields:
        - "applicationCode"

scenarios:
  - name: "Register in Race by Order"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
          capture:
            - json: "$.results.id"
              as: "trackId"