performance/artilleryRacePostTest.yml
config:
  target: "http://192.168.49.2:31522"
  #"http://192.168.49.2:31660"
  #192.168.49.2:31097
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 40
  phases:

    - duration: 30
      arrivalRate: 100

  payload:

    path: "applicationId.csv"
    fields:
        - "applicationCode"

scenarios:
  - name: "Register in Race by Order"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
          capture:
            - json: "$.results.id"
              as: "trackId"