performance/artilleryRacePostTest.yml
config:
  target: "http://192.168.49.2:32002"
  #"http://192.168.49.2:31660"
  #192.168.49.2:31097
#  payload:
#      # path relativo a la localización del script de test
#      path: "users.csv"
#      fields:
#        - "username"
#        - "password"
  phases:
    - duration: 10
      arrivalRate: 100

  payload:
    path: "application_202211061120.csv"
    fields:
        - "applicationCode"
        - "athleteId"
        - "raceId"

scenarios:
  - name: "Search and buy"
    flow:
      - post:
          url: "/api/tracks/byorder"
          json:
            applicationCode: "{{ applicationCode }}"
            athleteId: "{{ athleteId }}"
            raceId: "{{ raceId }}"
          capture:
            - json: "$.id"
              as: "trackId"